
public class ex_이론 {

	//추상화
	// -클래스간의 공통점을 찾아내서 공통의 조상을 만드는 작업
	// -상속 계층도를 따라 올라갈수록 클래스의 추상화는 더욱 심화된다.
	
	//구체화
	//상속을 통해 클래스를 구현,확장하는 작업
	
	//추상 메소드(abstract method)
	// 선언되어 있으나 구현되어 있지 않은 메소드
	// 추상 메소드 선언
	//  abstract 키워드로 선언
	// 추상메소드는 서브 클래스에서 오버라이딩하여 구현
	
	//추상 클래스(abstract class)
	// 추상 메소드를 하나라도 가진 클래스
	//  클래스 앞에 반드시 abstract라고 선언해야 함
	// 추상 메소드가 하나도 없지만 클래스 앞에 abstract로 선언한 경우
	
	//추상클래스 특성
	// 추상 클래스의 객체는 생성할 수 없다
	// 추상클래스 필요성
	// -상속관계에서 서브클래스가 반드시 구현해야함을 알릴때(강제성
	// 설계와 구현 분리
	//  -슈퍼 클래스에서는 개념적 특징 정의
	//  -서브 클래스에서 구체적 행위구현
	
	
	
	
}
