package ex02;

public class ex_상속개념 {

	public static void main(String[] args) {
	
		//Java의 상속
		//: 기존 클래스의 변수(데이터)와 메소드(로직,코드)를
		// 물려받아 새로운 클래스를 구성하는 것.
		
		//상속을 사용해서 얻는 장점
		//- 기존 클래스의 변수와 코드를 재사용
		//- 먼저 작성된 검증된 프로그램을 재사용
		//- 클래스간 계층적 분류 및 관리
		
		//class 서브(자식)클래스 extends 슈퍼(부모)클래스
		
		//상속의 특징
		// 1.다중상속을 지원하지 않는다
		// 2.상속의 횟수에 제한을 두지 않는다
		// 3.모든 클래스는 java.lang.Object를 상속받는다.
		
		
	
		//오버라이딩
		// 자식클래스에서 부모클래스와 동일한 메소드를 재정의 하는것
		
		//오버라이딩의 조건
		//메소드의 이름이 같아야한다.
		//메소드 매개변수의 개수와 데이터 타입이 같아야한다.
		//메소드의 리턴 타입이 같아야한다.
		
		//중요! overriding(재정의한다) vs overloading(중복정의를 한다)
		// riding(올라탄다) : 부모클래스의 메소드의 동작방법을 변경
		// loading : 같은 이름, 다른 매개변수의 메소드들을 여러 개 만들수 있다.
		
		//캐스팅
		// 기존 데이터 타입을 다른 데이터타입으로 변환하는 것
		
		//Primitive Type
		// 데이터 공간의 크기
		
		//Object Type
		// 객체 내 필드,메소드의 접근권한
		// UPcasting , Downcasting
		
		
		
		
		
		
		

	}

}
